

#ניצור רשימה בא כל אינדקס יציין את מספר הפעמים שחזר המסספר מהמשתמש


#          0        1        2     .. 10
#         count0   count1   count2    count10
#numbers = [0,       0,       0, .....  0]
# 1 1 2 2 2

counts: list[int] = []     # רשימה בא תרוץ הלולאה שתמנה את מספר הפעמים בא חזרו המספרים
for i in range(11):        # ברשימה יהיו 10 מקומות
    counts.append(0)       # כל אחד מהם יתחיל עם המספר 0 שאומר שעדין לא נכתב שום מספר

SENTINEL= -999             # יציאה מהתוכנית
while True:                # הלולאה תרוץ כל עוד התנאים בא נכונים
    num: int = int(input("enter number: "))   # בתחילה המשתמש יתבקש לכתוב מספר כלשהו
    if num == SENTINEL:    #אם יכתוב את המספר -999
        break              # יצא מהתוכנית תנאי העצירה
    if not 0 <= num <= 10: # אם יכתוב מספרים שהם לא בטווח הנדרש
        continue           # התוכנית תתעלם והוא יתבקש להקיש מספר נוסף
    counts[num] += 1       # ברגע שיתקבל מספר מתאים מקומו של המספר שהוקש ברשימה גדל ב1

    print("Statistics: ", end="") # כך יודפסו הסטטיסטיקות
    for i in range(10 + 1):       #הלולאה רצה בכל אינדקס ברשימה
        if counts[i]:             # לכל אינדקס ברשימה
            print(f"[{i}]: {counts[i]}", end=" ")  # יודפס האינדקס עצמו/ המיקום של המספר וכמות החזרות של כל אינדקס מסםר
    print()